/*
Текст задания:
Создать свой собственный Git репозиторий
*/

package ru.mirea.lab1;

public class Task2 {
    public void runTask() {
        System.out.println("Git репозиторий создан!\nСсылка: https://github.com/ArzimanOff/mirea_ads_projects");
    }
}
